In [2]:
import pandas as pd
df=pd.read_csv('../data/student_performance.csv')
df.head()

   student_id  study_hours  attendance  exam_score  gender
0           1            2          65          45    Male
1           2            4          70          55  Female
2           3            6          80          65    Male
3           4            8          90          78  Female
4           5            1          50          40    Male

In [3]:
df

    student_id  study_hours  attendance  exam_score  gender
0            1            2          65          45    Male
1            2            4          70          55  Female
2            3            6          80          65    Male
3            4            8          90          78  Female
4            5            1          50          40    Male
5            6            3          60          50  Female
6            7            5          75          60    Male
7            8            7          85          72  Female
8            9            9          95          88    Male
9           10            2          55          48  Female
10          11            4          68          58    Male
11          12            6          82          70  Female
12          13            8          88          80    Male
13          14            5          77          66  Female
14          15            7          92          85    Male
15          16            3          63          52  Female
16          17            9          98          90    Male
17          18            6          85          74  Female
18          19            4          72          59    Male
19          20            8          90          82  Female

In [5]:
import seaborn as sns
import matplotlib.pyplot as plt

sns.set_style("whitegrid")
df.info()
df.describe()

<class 'pandas.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   student_id   20 non-null     int64
 1   study_hours  20 non-null     int64
 2   attendance   20 non-null     int64
 3   exam_score   20 non-null     int64
 4   gender       20 non-null     str
dtypes: int64(4), str(1)
memory usage: 932.0 bytes

       student_id  study_hours  attendance  exam_score
count    20.00000    20.000000   20.000000   20.000000
mean     10.50000     5.350000   77.000000   65.850000
std       5.91608     2.433862   13.787867   15.037759
min       1.00000     1.000000   50.000000   40.000000
25%       5.75000     3.750000   67.250000   54.250000
50%      10.50000     5.500000   78.500000   65.500000
75%      15.25000     7.250000   88.500000   78.500000
max      20.00000     9.000000   98.000000   90.000000

## Project Questions

1. How do study hours affect exam scores?
2. Does attendance impact performance?
3. What is the distribution of student scores?

In [6]:
df.isnull().sum()

student_id     0
study_hours    0
attendance     0
exam_score     0
gender         0
dtype: int64

In [7]:
df.duplicated().sum()

np.int64(0)